src/tr069/samples/tr069_inform_req.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
      <cwmp:ID soapenv:mustUnderstand="1">TR1251.NVM0.0</cwmp:ID>
  </soapenv:Header>
  <soapenv:Body>
    <cwmp:Inform>
      <DeviceId xmlns="urn:dslforum-org:cwmp-1-0">
        <Manufacturer xsi:type="xsd:string">Actiontec</Manufacturer>
        <OUI xsi:type="xsd:string">000FB3</OUI>
        <ProductClass xsi:type="xsd:string">MI424WR</ProductClass>
        <SerialNumber xsi:type="xsd:string">cavisson123</SerialNumber>
      </DeviceId>
      <cwmp:Event soap:arrayType="cwmp:EventStruct[2]">
         <cwmp:EventStruct>
          <EventCode>0 BOOTSTRAP</EventCode>
          <CommandKey></CommandKey>
        </cwmp:EventStruct>
        <cwmp:EventStruct>
          <EventCode>1 BOOT</EventCode>
          <CommandKey></CommandKey>
        </cwmp:EventStruct>
      </cwmp:Event>
      <MaxEnvelopes>1</MaxEnvelopes>
      <CurrentTime>2011-07-28T20:13:22Z</CurrentTime>
      <RetryCount>0</RetryCount>
      <ParameterList soap:arrayType="cwmp:ParameterValueStruct[7]">
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.DeviceInfo.SpecVersion</Name>
          <Value xsi:type="xsd:string">yyyy</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.DeviceInfo.HardwareVersion</Name>
          <Value xsi:type="xsd:string">xxxx</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.DeviceInfo.SoftwareVersion</Name>
          <Value xsi:type="xsd:string">1.1.1.1</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.DeviceInfo.ProvisioningCode</Name>
          <Value xsi:type="xsd:string">00100A</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestURL</Name>
          <Value xsi:type="xsd:string">http://127.0.1.1:8001/ConnectionRequest?command=cr&amp;sn=9999</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.ManagementServer.ParameterKey</Name>
          <Value xsi:type="xsd:string">zzzz</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>InternetGatewayDevice.WANDevice.1.WANConnectionDevice.1.WANPPPConnection.1.ExternalIPAddress</Name>
          <Value xsi:type="xsd:string">172.0.0.1</Value>
        </ParameterValueStruct>
      </ParameterList>
    </cwmp:Inform>
  </soapenv:Body>
</soapenv:Envelope>
